[
  {
    "service": "AIR FORCE",
    "name": "Su-30MKI",
    "model": "Sukhoi Su-30 (Flanker-H",
    "country": "Russia",
    "units": 260,
    "role": "Multirole",
    "assessment": "Modern Solution",
    "description": "The modern IAF operates the Su-30MKI variant of the Su-30 Flanker-H line. These originated in Russia with a strong pedigree but are manufactured locally by HAL of India. Service introduction of the type was in 2002 and approximately 300 or so have been (or will be) built to date. At its core, the platform is a supersonic, multirole twin-engined jet fighter and the perfect spearhead to any aerial action involving the service. Variants include the Su-30MKA and the Su-30MKM.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/su30.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/92ca062c90fd45ffb6ce8144dc46004a/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Jaguar IM/IS",
    "model": "SEPECAT Jaguar",
    "country": "France",
    "units": 130,
    "role": "Strike",
    "assessment": "Aging, Requires Attention",
    "description": "The SEPECAT Jaguar is a dedicated strike platform of British-French origination. The IAF fields 130 airframes of the type. The design is rooted in Cold War doctrine and was developed in the 1960s before being introduced in 1973. Production ran from 1968 until 1981 resulting in 543 examples built for various global parties including India - who remains its sole operator today.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/jaguar.webp",
    "flag_url": "flags/france.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/c0ac78b8a5de491a96606ec077418c98/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "MiG-29UPG",
    "model": "Mikoyan MiG-29 (Fulcrum",
    "country": "Soviet-union",
    "units": 65,
    "role": "Multirole",
    "assessment": "Aging, Requires Attention",
    "description": "The Soviet-era MiG-29 Fulcrum is represented in the IAF inventory by 65 examples configured for multirole. These are of the MiG-29UPG mark. The single-seat, twin-engined jet fighter emerged in the 1970s and was introduced into service with Soviet forces in 1983, eventually evolved into a broad set of operational marks. Over 1,600 airframes have been built to the base design. While its best days are behind it, the platform maintains some value in the skies today. Twin-seat trainer marks exist for fighter / combat training endeavors.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mig29.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/6dad8b61907e4886b8b70f645008274c/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "MiG-21 BISON",
    "model": "Mikoyan-Gurevich MiG-21 (Fishbed",
    "country": "Soviet-union",
    "units": 54,
    "role": "Fighter",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "A true Cold War-era veteran, the supersonic, single-seat, single-engined Mikoyan-Gurevich MiG-21 Fishbed is still operated by a handful of global powers today including India. The IAF fields 54 active frontline examples under the Bison name primarily in the interceptor role. Service entry occurred in 1959 and nearly 12,000 were built for the Soviets and allies into 1985. For the IAF, the series is set to be replaced by the incoming HAL Tejas lightweight multirole fighter which will broaden capabilities considerably.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mig21.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/18927e007c3b47ed9e676f88b4adb578/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "M2000H/I",
    "model": "Mirage 2000",
    "country": "France",
    "units": 44,
    "role": "Fighter-Bomber",
    "assessment": "Aging, Requires Attention",
    "description": "Despite its Cold War roots, the French Dassault Mirage 2000 continues to be employed by air services around the globe. The delta-winged design is capable of limited ground strikes while providing a solution in the air-to-air role - a true dual-role performer. Around 44 are kept in frontline active status with the IAF in the M2000H/I marks. Dassault manufactured a total of 601 airframes from 1978 into 2007 but its best days are behind it - design work took place in the 1970s and series entry followed in 1984. The IAF also operates the M2000 in its dedicated trainer form.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/m2000.webp",
    "flag_url": "flags/france.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/88c41837ad7e4572bc2a62828d7f1f0a/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Rafale EH/DH",
    "model": "Dassault Rafale",
    "country": "France",
    "units": 36,
    "role": "Multirole",
    "assessment": "New Procurement",
    "description": "The cream of the IAF crop is the all-modern French Dassault Rafale. This is a 4th Generation, twin-engined multirole platform developed at the end of the Cold War period before taken into service by the French Air Force and Navy. The series was introduced in 2001 and has remained in production since 1986 as more and more customers are being named with each passing year. The IAF fleet consists of 36 of the Rafale EH/DH marks and provides the service with its best-performing and most versatile attack / defense aircraft.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/rafale.webp",
    "flag_url": "flags/france.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/fabb8472bc2e413282c80406b13ff1a7/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Tejas Mk.1",
    "model": "HAL Tejas",
    "country": "India",
    "units": 32,
    "role": "Multirole",
    "assessment": "New Procurement",
    "description": "The HAL Tejas is a wholly indigenous lightweight fighter solution nearing the end of its formal development phase for India. The design is currently available in two key marks, the Mk.1 and the follow-up Mk.1A. of the two, the Mk.1 is represented through 32 total airframes as the Mk.1A remains on order (73-strong expected). Tejas relies on a proven delta-wing planform and single-seat, single-engine design, giving it supersonic performance and a plethora of hardpoints on which to mount various ordnance types. First-flight was recorded in January 2001 though series entry did not occur until Janaury of 2015. About 40 or so airframes have been built in total. The Tejas Mk.2 is an advanced form intended for the IAF but remains in the prototype stages.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/tejas.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/fd95c85e2452490cbe32f80175498441/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi-17V-5",
    "model": "Mil Mi-17",
    "country": "Russia",
    "units": 223,
    "role": "Transport/Gunship",
    "assessment": "Aging, Requires Attention",
    "description": "Like other global defense powers allied to Russia, the IAF retains a stock of the venerable and versatile Mil Mi-17 Hip transport-gunship helicopter. The type is represented through some 223 total airframes in the service, making it the most quantitative available. The design has seen considerable combat service over the past several decades and is an evolution of the original Cold War-era Mi-8. It features a twin-engine layout and can house combat-ready troops in the hull or carry sling loads under it. Beyond its transport role, wingstubs can be affixed to provide for an attack functionality as needed. The IAF operates the Mi-17V-5 operational mark.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mi17.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/ab981d28f7124a489cd1b1992b2e467b/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Dhruv",
    "model": "HAL Dhruv",
    "country": "India",
    "units": 107,
    "role": "Utility",
    "assessment": "Modern Solution",
    "description": "The HAL Dhruv is a locally designed, developed, and manufactured light-to-medium utility helicopter introduced in 2002. The series has gone to stock the inventories of the Air Force, Army, Navy, and Coast Guard services of India and 335 airframes have been completed to date. The design also serves as the framework for the Prachand attack helicopter and the HAL LUH. For its part, the IAF operates around 107 of the type.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/dhruv.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "Chetak",
    "model": "HAL Chetak",
    "country": "India",
    "units": 77,
    "role": "Light Utility",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The HAL Chetak is nothing more than the French Alouette III light utility helicopter. Seventy-seven are kept in active service with the IAF and were manufactured under license. The type has shown to be capable of excellent high-altitude operations especially for the MEDEVAC role. It is powered by a single engine driving a three-bladed main rotor unit and three-bladed tail rotor unit.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/alouetteiii.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "AH-64E",
    "model": "Boeing AH-64 Apache",
    "country": "United-states",
    "units": 22,
    "role": "Attack Helo",
    "assessment": "Modern Solution",
    "description": "Playing both sides of the East-vs-West fence, India has committed to the American Boeing AH-64 Apache attack helicopter. This twin-seat (tandem), twin-engined platform is a proven tank-killer with a focus on crew survival. The services operates 22 of the E-model variant which is the AH-64D Block III and features improvements and modernizations to keep the attack platform viable over the modern battlefield for the foreseeable future. Over 500 have been built for various parties including India.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/ah64.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/c3b58008c46b45048fdd7dd283a3c8c8/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Cheetah",
    "model": "HAL Cheetah",
    "country": "India",
    "units": 18,
    "role": "Light Utility",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The HAL Cheetah is a locally-built light-class helicopter optimized for the general utility role and based in the French Cold War-era Aerospatiale SA315B Lama high-altitude performer. About 18 airframes are kept in active circulation and the series was adopted in 1972. All are locally-built by HAL of India.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/f06dd7466af6475ebaa9593d9866fd13/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Rudra",
    "model": "HAL Rudra",
    "country": "India",
    "units": 16,
    "role": "Attack Helo",
    "assessment": "Modern Solution",
    "description": "The HAL Rudra is a light-class, locally-built (HAL of India) gunship helicopter based in the unarmed HAL Dhruv series. The helicopter was adopted in 2012 and developed to undertake light-to-medium attack roles by way of incorporation of outboard wingstubs holding cannon, rocket, and missile armament. The series serves both the Indian Air Force and Army. 91 total air frames have been built with 75 on order. Production has been ongoing since 2007.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/rudra.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "CH-47F",
    "model": "Boeing CH-47 Chinook",
    "country": "United-states",
    "units": 15,
    "role": "Medium-Lift",
    "assessment": "Modern Solution",
    "description": "The American Boeing CH-47F Chinook model plays a critical role within the inventory of the Indian Air Force, optimized for medium-lift duties. The versatile tandem rotor design is a proven over-battlefield commodity and can be used to ferry dozens of troops, paletted cargo, light vehicles, and underslung cargo / artillery loads as needed. The series was taken into service by the IAF in 2019 with 15 in active circulation and a further 7 on order.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/ch47.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/cdac73e931f6482e86960a326fef73bf/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi-24/25/35",
    "model": "Mil Mi-24 (Hind",
    "country": "Russia",
    "units": 15,
    "role": "Gunship/Transport",
    "assessment": "Aging, Requires Attention",
    "description": "The venerable Soviet-era Mil Mi-24 Hind helicopter still forms an important part of the rotorcraft attack force of the IAF. The versatility of the platform to undertake direct-attack and troop insertion/extraction roles is proven, making the Hind a true dual-role performer for the service. Fifteen airframes are kept on hand, these being a mix of the Mi-24/25/35 types. The helicopters are fielded alongside the in-service AH-64 Apache from America, a dedicated attack helicopter design with no troop-carrying ability.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mi24.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/78082af447d1477f9d0a6aab6ec7a6ba/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Prachand",
    "model": "HAL Prachand",
    "country": "India",
    "units": 4,
    "role": "Attack Helo",
    "assessment": "New Procurement",
    "description": "The Prachand is under development by HAL of India as a dedictaed attack helicopter. The design has been in development for some time, completing its first fligth in 2010 and somewhat officially being introduced in 2021. To date, just nineteen or so airframes have been completed for the Indian Army and Air Force services since production began in 2017. It is build upon the framework of the established HAL Dhruv helicopter though seats its crew of two in tandem and has more of a direct-attack, tank-killing role.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/prachand.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "An-32/32RE",
    "model": "Antonov An-32 (Cline",
    "country": "Soviet-union",
    "units": 103,
    "role": "Tactical Transp.",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The modern IAF still makes use of the ages-old, classic Soviet tactical airlifter, the Antonov An-32. The twin-turboprop design is operated in the transport role through an impressive stock of 103 airframes. Fifty-three of these have been upgraded to the An-32RE standard but the design remains rooted in Cold War-era thinking - the series taken on by the IAF in 1982 while there still was a Cold War being fought between East and West.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/an32.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "HS.748",
    "model": "Hawker Siddeley HS.748",
    "country": "United-kingdom",
    "units": 57,
    "role": "Tactical Transp.",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Hawker Siddeley HS.748 is a vestige of the deep-Cold War period, built by British aero-industry from 1961 to 1988 to the tune of 380 total airframes. At its core, the aircraft is a fixed-wing, twin-engined utility type whose first-flight was had in 1960. While its best flying days are clearly behind it, the series continues to solidier on for powers like the IAF - the sole military user of the design today. The HS.748 is slated to be replaced in service by the Airbus C-295 twin-turboprop shoulder-winged tactical transport of which 56 are on order to be built locally by Tata Advanced Systems.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/united-kingdom.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/91f41e95e41748f585a5ac9fbc0202f8/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Do 228-201",
    "model": "Dornier Do 228",
    "country": "Germany",
    "units": 53,
    "role": "Utility",
    "assessment": "Aging, Requires Attention",
    "description": "Some 58 total German Dornier Do 228-201 series turboprop utility transports are operated by the IAF. These are locally-built under the HAL of India brand label and were adopted by the service in 1983. The original design dates back to a first-flight recorded in March 1981 and 245 airframes were completed by the parent company, HAL added another 125. The series is a proven performer despite its Cold War-era roots.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/do228.webp",
    "flag_url": "flags/germany.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/f24b42d883e744118244d29f5867bdea/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-76MD",
    "model": "Ilyushin Il-76 (Candid",
    "country": "Soviet-union",
    "units": 17,
    "role": "Strategic Transp.",
    "assessment": "Aging, Requires Attention",
    "description": "The Ilyushin Il-76 is standard Soviet-Russian strategic-level transport aircraft. The design is granted exceptional range due to its quadruple engine layout. The deep hold can ferry cargo, troops, and vehicles across the globe. In production since 1971, over 950 total airframes have been produced for the Russians and its allies including the IAF. The design has proven versatile enough to be converted into the Il-78 aerial tanker and the special-mission Beriev A-50 and Chinese KJ-2000 AWACS platforms.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/il76.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/7ef0950a76d94248b45b9a364063d4e8/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "C-130J-30",
    "model": "Lockheed C-130J Super Hercules",
    "country": "United-states",
    "units": 12,
    "role": "Tactical Transp.",
    "assessment": "Modern Solution",
    "description": "The all-modern Lockheed C-130J Super Hercules is represented in the IAF inventory through 12 examples. These are used in the tactical-level airlifter role. The versatile hauler was debuted in 1996 and entered service in 1999 as a modernization of the classic high-winged design. The USAF and USMC are two of the more notable operators of the type in number.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/c130j.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/616b33c65a714a52b50db5c6dac62e48/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "C-17",
    "model": "Boeing C-17 Globemaster III",
    "country": "United-states",
    "units": 11,
    "role": "Strategic Transp.",
    "assessment": "Modern Solution",
    "description": "The modern IAF operates a fleet of eleven American Boeing C-17 strategic airlifters, covering the heavy-haul duties of the service. The quadruple jet-engined platform is the primary strategic hauler of the USAF and a proven veteran of modern warfare. Service entry of the series was in 1995 and nearly 300 airframes have been completed to date.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/c17.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/597e0d7f9e3446719a2f2de3dd3fa67d/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Legacy 600",
    "model": "EMBRAER Legacy 600",
    "country": "Brazil",
    "units": 4,
    "role": "VIP",
    "assessment": "Aging, Requires Attention",
    "description": "The Brazilian EMBRAER Legacy 600 series business jet serves the IAF in the VIP passenger role. Four are kept in the active inventory. The original design went airborne for the first time in 2001 and was debuted in 2002. Production ran into 2020 and nearly 200 airframes were completed in all.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/legacy.webp",
    "flag_url": "flags/brazil.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/e66311b3fcd24401a323837e20a80bcb/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Boeing 737-700",
    "model": "Boeing 737",
    "country": "United-states",
    "units": 3,
    "role": "VIP",
    "assessment": "Aging, Requires Attention",
    "description": "The classic, and globally popular, Boeing 737 serves in VIP and special-mission roles for the modern IAF. The twin-jet passenger airliner is a proven performer across multiple markets, given excellent range and performance for an aircraft of this class, making it an ideal versatile platform for even the most discerning customer.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/737.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/bd2d73c132d14a609dbf13bd4cdc652e/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Boeing 777",
    "model": "Boeing 777",
    "country": "United-states",
    "units": 2,
    "role": "VIP",
    "assessment": "Modern Solution",
    "description": "The Boeing 777 first went into the air in 1994 and was introduced with carrier United Airlines in 1995. To date, there have been 1,706 total air frames completed for global operators including India. The Triple-Seven serves in the governmental VIP role, standing in as Air India One for official presidential duties.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/777.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/861878c67a6a4a3faa46107065eddbfc/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-78MKI",
    "model": "Ilyushin Il-78 (Midas",
    "country": "Soviet-union",
    "units": 6,
    "role": "Aerial Refueling",
    "assessment": "Aging, Requires Attention",
    "description": "The IL-78 (Midas) is the converted aerial tanker form of the original Ilyushin Il-76 strategic transport. Fifty-three of the series have been produced to date following a first-flight in 1983. The type serves in the critical air refuleing role, keeping warplanes in the air for considerable amounts of time. Nevertheless, the quadruple-engined platform is a product of the late-Cold War period.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/il78.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/0c0da2cc1b4c441dadc2510212c25fb7/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "EMB-145",
    "model": "EMBRAER EMB-145",
    "country": "Brazil",
    "units": 3,
    "role": "AEW&C",
    "assessment": "Aging, Requires Attention",
    "description": "The IAF maintains a fleet of 3 Brazilian EMB-145 jet aircraft for the Airborne Early Warning and Control (AWACS) role. These are fielded with local DRDO Netra AEWC systems. The original aircraft is based in the EMBRAER R-99 design operated by the Brazilian Air Force in same role. First-flight was recorded in 1999 and service entry took place in 2001. Greece and Mexico also operate the type.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/erj145.webp",
    "flag_url": "flags/brazil.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "A-50EI",
    "model": "Beriev A-50 (Mainstay",
    "country": "Soviet-union",
    "units": 3,
    "role": "AEW&C",
    "assessment": "Aging, Requires Attention",
    "description": "The Beriev A-50 is a Soviet Cold War-era design for the AWACS role. The modern IAF fields a collection of 3 of the aircraft and these carry EL/W-2090 series radar fits. The variant in question is the A-50EI. The original Soviet design succeeded an aging fleet of Tu-126 aircraft in same role. Developed from the quadruple-engine Ilyushin IL-76, a first-flight occurred in 1978 and service entry followed in 1985. Production of the 40 units completed spanned from 1978 until 1992.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/a50.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "Gulfstream III",
    "model": "Gulfstream III",
    "country": "United-states",
    "units": 3,
    "role": "ELINT",
    "assessment": "Aging, Requires Attention",
    "description": "The American Gulstream III twin-jet serves the modern IAF in the EW/ELINT role. Three total airframes currently make up the active fleet. The versatile design appeared in the skies for the first time in late-1979 and was introduced in 1980. Production then ran from 1979 until 1986 to which 202 total aircraft were produced by the company for both civilian and government use. It was based in the Gulfstream II and further developed into the popular Gulfstream IV.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/giii.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/ff7f89e44dab48af8ef283bef7a2297a/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "G100",
    "model": "Gulfstream G100",
    "country": "United-states",
    "units": 2,
    "role": "Reconnaissance",
    "assessment": "Aging, Requires Attention",
    "description": "The IAF operates the Gulfstream G100 compact business jet in the surveillance role through 2 examples. The type first entered service in 1984 and was produced into 2017 resulting in the G200 offshoot. The United States Navy is one of its primary operators alongside India.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "Global 5000",
    "model": "Bombardier Global 5000",
    "country": "Canada",
    "units": 2,
    "role": "EINT",
    "assessment": "Aging, Requires Attention",
    "description": "The Canadian Bombardier Global 5000 is operated in the ELINT role by the IAF through two active examples. At its core, the design is a swept-back wing, twin-engine business jet which entered service in mid-1999. From 1998 onwards, over 815 airframes have been completed. The design has been evolved into the Global 7500/8000 offering and notable variants include the Saab GlobalEye and Raytheon Sentinel.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/global5000.webp",
    "flag_url": "flags/canada.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "Boeing 737",
    "model": "Boeing 737",
    "country": "United-states",
    "units": 2,
    "role": "Reconnaissance",
    "assessment": "Aging, Requires Attention",
    "description": "The classic, and globally popular, Boeing 737 serves in VIP and special-mission roles for the modern IAF. The twin-jet passenger airliner is a proven performer across multiple markets, given excellent range and performance for an aircraft of this class, making it an ideal versatile platform for even the most discerning customer.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/737.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/bd2d73c132d14a609dbf13bd4cdc652e/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Boeing 707",
    "model": "Boeing 707",
    "country": "United-states",
    "units": 1,
    "role": "Reconnaissance",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The American Boeing 707 dates back to a service entry in 1958 and a production run that spanned from 1956 until 1978. The four-engined jet airliner was adopted by the IAF in 1987 with a sole example being operated in the surveillance role under the Boeing 707-337C guise.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/707.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/98277cafde184981a02c11388468b2aa/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Hawk 132",
    "model": "BAe Hawk",
    "country": "United-kingdom",
    "units": 102,
    "role": "Advanced Jet Trainer",
    "assessment": "Aging, Requires Attention",
    "description": "The IAF manages a stock of 102 Hawk 132 jets from the BAe Hawk series. The air service is one of the few remaining operators of the type in number. The light jet is a product of the Cold War period, flying for the first time in 1974 and introduced in 1976. Over 1,000 airframes were eventually produced into 2022 ensuring the series maintains an active existence somewhere in the world for the foreseeable future. Like the Indian Navy, the IAF utilizes the Hawk for the Advanced Jet Training role, bridging the learning gap between its basic trainer and combat training fleets.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/hawk.webp",
    "flag_url": "flags/united-kingdom.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/f26b4b1d58b24d44b9205d26d1e8f555/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Kiran",
    "model": "HAL Kiran",
    "country": "India",
    "units": 78,
    "role": "Jet Trainer",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The HAL Kiran is one of the more quantitatively available airman training platforms available to the IAF today. Like other aircraft of the service, it is rooted in the Cold War period, first-flying in 1964 and introduced in 1968 to fulfill a standing Intermediate Jet Trainer requirement for the Indian military. From 1964 to 1989, one-hundred ninety examples were built in all of this twin-seat (side-by-side), straight-winged, jet-powered trainer. Both the IAF and Indian Navy eventually took on the indigenous design which still soldiers on in active service.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/kiran.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "PC-7",
    "model": "Pilatus PC-7",
    "country": "Switzerland",
    "units": 75,
    "role": "Basic Trainer",
    "assessment": "Aging, Requires Attention",
    "description": "DESCRIPTION.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/pc7.webp",
    "flag_url": "flags/switzerland.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/b13c98ceef134febac09dacc51c005f7/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "P.Virus",
    "model": "Pipistrel Virus SW80 Garud",
    "country": "Slovenia",
    "units": 72,
    "role": "Basic Trainer",
    "assessment": "Aging, Requires Attention",
    "description": "DESCRIPTION.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/slovenia.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "MiG-21U/UM",
    "model": "Mikoyan-Gurevich MiG-21 (Fishbed",
    "country": "Soviet-union",
    "units": 37,
    "role": "Fighter Trainer",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "A true Cold War-era veteran, the supersonic, single-seat, single-engined Mikoyan-Gurevich MiG-21 Fishbed is still operated by a handful of global powers today including India. The IAF fields 54 active frontline examples under the Bison name primarily in the interceptor role. Service entry occurred in 1959 and nearly 12,000 were built for the Soviets and allies into 1985. The IAF maintains a fleet of 37 MiG-21s for training, these in the U/UM production mark forms.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mig21.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/18927e007c3b47ed9e676f88b4adb578/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "JaguarIB",
    "model": "SEPECAT Jaguar",
    "country": "France",
    "units": 30,
    "role": "Strike Trainer",
    "assessment": "Aging, Requires Attention",
    "description": "The SEPECAT Jaguar is a dedicated strike platform of British-French origination. The IAF fields 130 airframes of the type. The design is rooted in Cold War doctrine and was developed in the 1960s before being introduced in 1973. Production ran from 1968 until 1981 resulting in 543 examples built for various global parties including India - who remains its sole operator today.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/jaguar.webp",
    "flag_url": "flags/france.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/c0ac78b8a5de491a96606ec077418c98/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "M2000TH/TI",
    "model": "Dassault Mirage 2000",
    "country": "France",
    "units": 12,
    "role": "Strike Trainer",
    "assessment": "Aging, Requires Attention",
    "description": "Despite its Cold War roots, the French Dassault Mirage 2000 continues to be employed by air services around the globe. The delta-winged design is capable of limited ground strikes while providing a solution in the air-to-air role - a true dual-role performer. Around 44 are kept in frontline active status with the IAF in the M2000H/I marks. Dassault manufactured a total of 601 airframes from 1978 into 2007 but its best days are behind it - design work took place in the 1970s and series entry followed in 1984. The IAF also operates the M2000 in its dedicated trainer form.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/m2000.webp",
    "flag_url": "flags/france.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/808fc97e2cc640ea90b8401348e82c5e/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "MiG-29UPG",
    "model": "Mikoyan MiG-29 (Fulcrum",
    "country": "Soviet-union",
    "units": 10,
    "role": "Fighter Trainer",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Soviet-era MiG-29 Fulcrum is represented in the IAF inventory by 65 examples configured for multirole. These are of the MiG-29UPG mark. The single-seat, twin-engined jet fighter emerged in the 1970s and was introduced into service with Soviet forces in 1983, eventually evolved into a broad set of operational marks. Over 1,600 airframes have been built to the base design. While its best days are behind it, the platform maintains some value in the skies today. Twin-seat trainer marks exist for fighter / combat training endeavors.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mig29.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/6dad8b61907e4886b8b70f645008274c/embed"
  },
  {
    "service": "ARMY",
    "name": "Cheetah",
    "model": "HAL Cheetah",
    "country": "India",
    "units": 160,
    "role": "Light Utility",
    "assessment": "Modern Solution",
    "description": "35 examples of the aging HAL Cheetah are still operated by the Indian Army in the high-altitude light utility / liaison roles. The design is of local manufature under HAl of India but based in the French Aerospatiale Alouette II. Service entry took place in 1971. Despite its age, the design still sees an additional 10 air frames on order today.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/f06dd7466af6475ebaa9593d9866fd13/embed"
  },
  {
    "service": "ARMY",
    "name": "Dhruv Mk.1/2/3",
    "model": "HAL Dhruv",
    "country": "India",
    "units": 141,
    "role": "Light Utility",
    "assessment": "Modern Solution",
    "description": "The HAL Dhruv is a locally designed, developed, and manufactured light-to-medium utility helicopter introduced in 2002. The series has gone to stock the inventories of the Air Force, Army, Navy, and Coast Guard services of India and 335 airframes have been completed to date. The design also serves as the framework for the Prachand attack helicopter and the HAL LUH. For its part, the IAF operates around 107 of the type.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/dhruv.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "ARMY",
    "name": "Rudra ALH-WSI",
    "model": "HAL Rudra",
    "country": "India",
    "units": 75,
    "role": "Attack Helo",
    "assessment": "Modern Solution",
    "description": "The HAL Rudra makes up an important part of Indian Army aviation capabilities, it being an armed version of the original Dhruv light utility design but optimized for the attack role. Some 75 are in the active inventory with an additional 25 on order. The helicopter has a fixed skid landing gear, side-by-side seating for the crew, a four-bladed main rotor system, and four outboard hardpoints for cannon pods, rocket pods, and missiles. A chin-mounted autocannon rounds out the list of armament features.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/rudra.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "ARMY",
    "name": "Prachand",
    "model": "HAL Prachand",
    "country": "India",
    "units": 5,
    "role": "Attack Helo",
    "assessment": "New Procurement",
    "description": "The Prachand is under development by HAL of India as a dedictaed attack helicopter. The design has been in development for some time, completing its first fligth in 2010 and somewhat officially being introduced in 2021. To date, just nineteen or so airframes have been completed for the Indian Army and Air Force services since production began in 2017. It is build upon the framework of the established HAL Dhruv helicopter though seats its crew of two in tandem and has more of a direct-attack, tank-killing role.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/prachand.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "ARMY",
    "name": "Chetak",
    "model": "HAL Chetak",
    "country": "India",
    "units": 4,
    "role": "Light Utility",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Chetak is an Indian license-built version of the French Alouette III light utility helicopter. Four are operated actively in the liaison / light utility roles.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/alouetteiii.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "MiG-29K",
    "model": "Mikoyan MiG-29 (Fulcrum-K",
    "country": "Soviet-union",
    "units": 35,
    "role": "Multirole",
    "assessment": "Aging, Requires Attention",
    "description": "The Indian Navy operates the navalized version of the MiG-29 supersonic twin-engined fighter of Soviet origina as well through thrity-five frontline airframes. The K-model was developed by the Soviets from the MiG-29M and ultimately developed the K-model into the more modern MiG-35. The design works well in conjunction with the Soviet aircraft carrier purchased and operationally used by the Indian Navy today.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mig29.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "Chetak",
    "model": "HAL Chetak",
    "country": "India",
    "units": 35,
    "role": "Light Utility",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "DESCRIPTION.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/alouetteiii.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "Sea King Mk.42B/C",
    "model": "Westland Sea King",
    "country": "United-kingdom",
    "units": 31,
    "role": "Search & Rescue",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Westland Sea King is a British helicopter of which 25 are represented in the modern IAF inventory. The series flew for the first time in 1969 and is a British production of the American Sikorsky S-61 model, itself an evolution of the Sikosrky SH-3 Sea King. Production took place from 1969 until 1995 and yielded over 350 airframes before the end. The Indian Navy operates the Sea King in its Mk.42B and C marks.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/seaking.webp",
    "flag_url": "flags/united-kingdom.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/10ce28cff53d40d5b7feb9a017a02806/embed"
  },
  {
    "service": "NAVY",
    "name": "Ka-28",
    "model": "Kamov Ka-27 (Helix",
    "country": "Soviet-union",
    "units": 14,
    "role": "ASW",
    "assessment": "Aging, Requires Attention",
    "description": "The Soviet-Russian Kamov Ka-27 is operated by the Indian Navy in its Ka-28 form to serve in the Anti-Submarine Warfare (ASW) role. Fourteen airframes are in active use today, these platforms proving critical in the hunting of undersea threats. The Ka-28 is the export version of the Soviet-Russian Ka-27PL and is known to NATO as the Helix-A.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/ka27.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/7fe5deb6632344d6a01b22b0cb3fc412/embed"
  },
  {
    "service": "NAVY",
    "name": "Dhruv Mk.I/II",
    "model": "HAL Dhruv",
    "country": "India",
    "units": 14,
    "role": "Utility",
    "assessment": "Modern Solution",
    "description": "The HAL Dhruv is a locally designed, developed, and manufactured light-to-medium utility helicopter introduced in 2002. The series has gone to stock the inventories of the Air Force, Army, Navy, and Coast Guard services of India and 335 airframes have been completed to date. The design also serves as the framework for the Prachand attack helicopter and the HAL LUH. For its part, the Indian Navy operates 14 of the type.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/dhruv.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "MH-60R",
    "model": "Sikorsky SH-60 Seahawk",
    "country": "United-states",
    "units": 2,
    "role": "ASW/SAR",
    "assessment": "Modern Solution",
    "description": "Indian Naval Aviation is modernizing by way of procuring the proven American Sikorsky SH-60 Seahawk platform. Two are in active service with a further 22 remaining on order. The helicopters will be used to fulfill the Anti-Submarine Warfare (ASW) and Search and Rescue (SAR) roles as they do for the United States Navy and others. The variant in question is the all-modern MH-60R offering.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mh60r.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "Do-228-201",
    "model": "Dornier Do 228",
    "country": "Germany",
    "units": 24,
    "role": "Reconnaissance",
    "assessment": "Aging, Requires Attention",
    "description": "Indian Naval Aviation relies on a healthy stable of 24 German Dornier Do 228-201 fixed-wing platforms in the surveillance role. An additional 11 airframes remain on order. These aircraft are reliable, versatile types seeing widespread global service. The high-wing loading of this aircraft ensures excellent low-and-slow capabilities, allowing the aircraft to remain on station for hours on end.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/do228.webp",
    "flag_url": "flags/germany.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/f24b42d883e744118244d29f5867bdea/embed"
  },
  {
    "service": "NAVY",
    "name": "P-8A",
    "model": "Boeing P-8 Poseidon",
    "country": "United-states",
    "units": 12,
    "role": "Maritime Patrol",
    "assessment": "New Procurement",
    "description": "Indian Naval Aviation is one of a growing number of global operators of the new Boeing P-8 Poseiden Maritime Patrol Aircraft (MPA). Twelve airframes make up the fleet. The design is rooted in an earlier United States Navy requirement that resulted in a Boeing 737-800 passenger airliner being converted for the role through specialized equipment, sensors, and processing systems added. Series production has been ongoing since 2009 and 160 have been built into mid-2023. Beyond the USN and IN, the navies of Britain and Australia both make use of the powerful type.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/p8.webp",
    "flag_url": "flags/united-states.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/3fc134024b69403bb5df5ab3aff48919/embed"
  },
  {
    "service": "NAVY",
    "name": "BN-2B/2T",
    "model": "Britten-Norman BN-2",
    "country": "United-kingdom",
    "units": 10,
    "role": "Maritime Patrol",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The venerable Britten-Norman Islander high-winged utility aircraft is still used operationally in the Indian Aviation Inventory. The original British design was born in June of 1965 while there was still a Cold War being fought and production eventually reached 1,280 units in all. For its part, India operates a modest fleet of 4 BN-2B/2T variants in the utility and patrol roles.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/bn2.webp",
    "flag_url": "flags/united-kingdom.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "Il-38",
    "model": "Ilyushin Il-38 (May",
    "country": "Soviet-union",
    "units": 5,
    "role": "Maritime Patrol",
    "assessment": "Aging, Requires Attention",
    "description": "India was once one of the largest importers of military goods in the world counting both the United States and the Soviet Union/Russia as primary suppliers. in the latter arrangement, this led to adoption of the Ilyushin Il-38 four-engined platform for the Anti-Submarine Warfare (ASW) / maritime patrol roles. Developed from the existing Il-18 airframe, the newer aircraft saw series introduction with Soviet forces in 1967 and a total of 58 of the type were produced from 1967 into 1972. Just four are operated by Indian Naval Aviation today.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/il38.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "Kiran",
    "model": "HAL Kiran",
    "country": "India",
    "units": 20,
    "role": "Jet Trainer",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The HAL Kiran is one of the more quantitatively available airman training platforms available to the IAF today. Like other aircraft of the service, it is rooted in the Cold War period, first-flying in 1964 and introduced in 1968 to fulfill a standing Intermediate Jet Trainer requirement for the Indian military. From 1964 to 1989, one-hundred ninety examples were built in all of this twin-seat (side-by-side), straight-winged, jet-powered trainer. Both the IAF and Indian Navy eventually took on the indigenous design which still soldiers on in active service.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/kiran.webp",
    "flag_url": "flags/india.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "Hawk 132",
    "model": "BAe Hawk",
    "country": "United-kingdom",
    "units": 17,
    "role": "Advanced Jet Trainer",
    "assessment": "Aging, Requires Attention",
    "description": "The Indian Navy is one of the few remaining air services operating the British BAe Hawk in number. The light jet is a product of the Cold War period, flying for the first time in 1974 and introduced in 1976. Over 1,000 airframes were eventually produced into 2022 ensuring the series maintains an active existence somewhere in the world for the foreseeable future. The Indian Navy maintains a stock of 17 Hawk 132 models for the Advanced Jet Training role, bridging the learning gap between its basic trainer and combat training fleets.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/hawk.webp",
    "flag_url": "flags/united-kingdom.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/f26b4b1d58b24d44b9205d26d1e8f555/embed"
  },
  {
    "service": "NAVY",
    "name": "MiG-29KUB",
    "model": "Mikoyan MiG-29 (Fulcrum-K",
    "country": "Soviet-union",
    "units": 8,
    "role": "Fighter Trainer",
    "assessment": "Aging, Requires Attention",
    "description": "The Soviet-era MiG-29 Fulcrum is represented in the IAF inventory by 65 examples configured for multirole. These are of the MiG-29UPG mark. The single-seat, twin-engined jet fighter emerged in the 1970s and was introduced into service with Soviet forces in 1983, eventually evolved into a broad set of operational marks. Over 1,600 airframes have been built to the base design. While its best days are behind it, the platform maintains some value in the skies today. Twin-seat trainer marks exist for fighter / combat training endeavors.",
    "image_url": "https://www.warpowerindia.com/imgs/aircraft/sml/mig29.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  }
]