[
  {
    "service": "AIR FORCE",
    "name": "Su-24M/M2",
    "model": "Sukhoi Su-24 (Fencer",
    "country": "Soviet-union",
    "units": 273,
    "role": "Strike",
    "assessment": "Aging, Requires Attention",
    "description": "The Su-24 represents the most quantitative available combat aircraft for the modern Russian Air Force with close to 300 airframes available. However, this twin-seat, twin-engine swing-fwing strike platform is rooted in the deep Cold War period, flying for the first time in mid-1967 and entering service in 1974. Around 1,4000 were eventually produced and modernization has helped to keep the platform viable for the interim as the line has been formally succeeded on paper by the Sukhoi Su-34 Fullback strike fighter series.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su24.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/f389c42519c2409fa13702c0f8e92d96/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Su-25/UB/SM/SM3",
    "model": "Sukhoi Su-25 (Frogfoot",
    "country": "Soviet-union",
    "units": 196,
    "role": "CAS",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Sukhoi Su-25 Frogfoot was the Soviet answer to the American A-10 Thunderbolt II tank-killer. Built for low-and-slow flying, battlefield survivability, and ordnance delivery, the aircraft has been in service since 1981 with a first-flight having been recorded in early-1975. Over 1,000 airframes were built for the Soviets as well as allies of the day between the period spanning 1978 to 2017. The single-seat, twin-engine platform features four hardpoints under each wing supporting rockets, bombs, and precision-guided ordnance.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su25.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/a17e07be737b4d0c8d359949662a90a9/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Su-34",
    "model": "Sukhoi Su-34 (Fullback",
    "country": "Russia",
    "units": 150,
    "role": "Strike",
    "assessment": "New Procurement",
    "description": "The Su-34 has quickly embedded itself as the premiere Russian attack platform. It is a major modification of the proven Su-27 air superiority platform and shares a similar mainplane arrangement and twin-engine layout. The crew is seated side-by-side in a wider nose section. The aircraft is optimized for the high-speed attack role. A first-flight was recorded on April 13th, 1990 and, after a protracted development period stunted by the fall of the Soviet Empire, the aircraft became formally operational in 2006. Over 155 air frames have been produced since then and includes seven test subjects.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su34.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/fcba809f43a7437891ead0ae1ee0ee82/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Su-27P/UB/SM/SM3",
    "model": "Sukhoi Su-27 (Flanker",
    "country": "Soviet-union",
    "units": 101,
    "role": "Multirole",
    "assessment": "Aging, Requires Attention",
    "description": "Despite its roots in the latter-Cold War period, the Su-27 Flanker series continues in service with the modern Russian Air Force though in ever-dwindling numbers. Over 680 whave been produced since 1982 and a myriad of variants have since strengthened the family tree. The aircraft benefits from an excellent balance of size, power, and performance through a single-seat, twin-engine arrangement. A first-flight was had in May 1977 and service introduction followed in June 1985. The Su-27 went on to form the foundation for other Flanker-related efforts including the Su-30, Su-33, Su-34, Su-35, Su-37, and Chinese J-11 aircraft.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su27.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/19fb0bc56cdf40b0a611f9c4fee16ef0/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "MiG-31BM/BSM/K",
    "model": "Mikoyan MiG-31 (Foxhound",
    "country": "Soviet-union",
    "units": 90,
    "role": "Interceptor",
    "assessment": "Aging, Requires Attention",
    "description": "The Mikoyan MiG-31 is a product of the Soviet Cold War era, first flown in 1975 and introduced in 1981. The type is a supersonic twin-seat, twin-engine interceptor design produced to the tune of 519 airframes between 1975 and 1994. It is based in the earlier MiG-25 Foxbat interceptor and introduces a second crewman seated in tandem. Despite its age, modernized forms continue to serve with the Russian Air Force and a select few other powers. Active service is expected to last into the early 2030s.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mig31.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/37965bf2b35e4f9596472a5fdf05eb57/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Su-35S",
    "model": "Sukhoi Su-35 (Flanker-E",
    "country": "Russia",
    "units": 118,
    "role": "Multirole",
    "assessment": "New Procurement",
    "description": "The Su-35 is the primary air superiority platform of the modern Russian Air Force. Some 118 are currently in active circulation as the type succeeds the aging line of original Su-27 models. Largely faithful in design to the Su-27, the newer aircraft retains the single-seat, twin-engine arrangement as well as supersonic performance. A first-flight was had in 1988 and the fighter suffered through a protracted developmental phase hindered by the fall of the Soviet Union in 1989-1991. It was not until February 2014 that the S-35 was formally inducted into service. Twelve Su-27M models served to prove the design sound and these were then followed by over 150 Su-35S production-reacy models.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su35.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/c98cf9b3b3e04017a04732798a31888a/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Su-30SM/M2",
    "model": "Sukhoi Su-30 (Flanker-C/-G/-H",
    "country": "Russia",
    "units": 110,
    "role": "Multirole",
    "assessment": "Modern Solution",
    "description": "The Su-30 series is a twin-seat, twin-egnine offshoot of the original Su-27 air superiority fighterline. First flown in December 1989, the series entered service in 1996 and has been taken on by Russian allies in Algeria, Armenia, Vietnam and others. Production has been ongoing since 1992 to the tune of 630 examples and counting. The Su-30 features its own potential offshoots in the Su-30MKI, Su-30MKK, Su-30MKM, and Su-30MKA. Beyond an inherent air superiority quality, the platform excels in the multirole category.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su30.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/b6faf803e5ad420d90972096594f6bb6/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "MiG-29S/UB/SMT/+",
    "model": "Mikoyan MiG-29 (Fulcrum",
    "country": "Soviet-union",
    "units": 87,
    "role": "Multirole",
    "assessment": "Aging, Requires Attention",
    "description": "The value of the Mikoyan MiG-29 Fulcrum lightweight fighter series conitnues to decline globally and fewer than 100 make up the active Russian Air Force fleet. Its vaslty modernized form is the MiG-35. The MiG-29 is currently fielded in the S, UB, SMT, and UBT forms for their part. The original design, forged as a counter to what became the American F-16, flew for the first time in October 1977 and was introduced in mid-1983. Over 1,600 airframes have been produced since 1981 and these continue to stock the Russian, Indian, Uzbekistan, and Ukrainian air services to name a few. Its primary role is air superiority though a ground-attack element is proven for the line.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mig29.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/d39e0996596948e59935ab465efb42ee/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Tu-22M3/M3M",
    "model": "Tupolev Tu-22M (Backfire",
    "country": "Soviet-union",
    "units": 67,
    "role": "Strat.Bomber",
    "assessment": "Aging, Requires Attention",
    "description": "The Tupolev Tu-22 is another vestige of the deep Cold War period, first-flown in mid-1969 and introduced in 1972. Production ran from 1967 to 1993 to the tune of 497 total airframes completed. The modernized form is the Tu-22M and these are based in the original Tu-22 design of the 1950s (311 built). A twin-engine swing-wing capability allows for supersonic performance. External hardpoints and an internal weapons bay allow for flexibility in ground attacks through conventional drop ordnance as well as precision-guided munitions.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu22m.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/5cb090f321294644877359c1265cb81e/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Tu-95MS/MS16",
    "model": "Tupolev Tu-95 (Bear",
    "country": "Soviet-union",
    "units": 42,
    "role": "Strat.Bomber",
    "assessment": "Aging, Requires Attention",
    "description": "The Tupolev Tu-95 Bear is the primary surveillance platform operated by the Russian Air Force and has an inherent bombing / missile-launching capability. The aircraft utilizes four powerful turboprop engines along a swept-back wing planform. The Tu-95 is based in the Tu-85 which, itself, was based in the Tu-4 - a direct copy of the American Boeing B-29 Superfortress which were captured by Soviet forces during World War 2. Bless with excellent range and performance for an aircraft of this size and role, the Tu-95 will continue in active service for a time longer. More than 500 Tu-95s have been built since 1952 and variants include the Tu-114, Tu-142, Tu-95LAL, and the Tu-116.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu95.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/b550941898c848de95ffeed8c8d7834f/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Tu-160/M",
    "model": "Tupolev Tu-160 (Blackjack",
    "country": "Soviet-union",
    "units": 16,
    "role": "Strat.Bomber",
    "assessment": "Aging, Requires Attention",
    "description": "The Tupolev Tu-160 Blackjack became the Soviet answer to the American Rockwell B-1 Lancer supersonic swing-wing bomber. A first-flight was had in late-1981 follwed by service entry in 1987 just before the fall of the Soviet Empire. Production of the design has been started and stopped multiple times resulting in 37 total air frames completed (nine used in testing). While 16 make up the current Russian Air Force fleet, an additional 10 remain on order.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu160.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/6cdcef13c1a244978cba2957e0394c88/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Su-57",
    "model": "Sukhoi Su-57 (Felon",
    "country": "Russia",
    "units": 11,
    "role": "Air Superiority",
    "assessment": "New Procurement",
    "description": "The Su-57 is the Russian 5th Generation Fighter response to the American F-22 Raptor stealth-centric air superiority series. The design has only recently entered operational service and total production is just over 21 air frames with around 11 in the active inventory. The single-seat, twin-engine design overtakes the Su-27 model on paper and flew for the first time in early-2010. Series introduction tookplace in late-2020. The Mach 2.0-capable platform can field all in-service Russia Air Force A2A weaponry and has a limited ground-attack functionality. A 30mm internal cannon can be used for extreme close-in actions while R37, R74, and R77 missiles are all supported across external and internal hardpoint / weapon stations.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su57.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/09d546b4355c4fa6882ca46e05069bee/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "MiG-35S/UB",
    "model": "Mikoyan MiG-35 (Fulcrum",
    "country": "Russia",
    "units": 6,
    "role": "Multirole",
    "assessment": "New Procurement",
    "description": "The Su-35 represents the ultimate evolution of the MiG-29 Fulcrum Cold War-era lightweight air superiority line - the variant born specifically from the MiG-29M offering. It brings along a mature ground-attack functionality to complete its multirole capabilities. A twin-seat (tandem) crew arrangement is featured along a proven twin-engine (side-by-side) configuration allowing for supersonic performance, enhanced agility, and modern avionics and radar. A first-flight was recorded in December 2016 with series introduction had in June 2019. Production has been ongoing since 2016 though yielding only six production and two developmental air frames.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mig35.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/1dcea306e8a14ed4ab4d11a819cb6676/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi-8/17",
    "model": "Mil Mi-8/17",
    "country": "Soviet-union",
    "units": 746,
    "role": "Transp/Gunship",
    "assessment": "Aging, Requires Attention",
    "description": "The Soviet-era Mi-8/-17 transport-gunship helicopter makes up the backbone of the Russian Air Force support fleet. The medium-lift helicopter has been built in nearly 20,000 examples and is operated the world over. First flying in 1961, the type was introduced in 1967 and has been progressively updated since. Its versatility lays in its ability to be armed through ATGMs, cannon pods, and missile pods while carrying self-defense machine guns. In this way, the singular vehicle can not only ferry combat troops into warzones but also supply CAS functionality thereafter. The Mi-17 offering is a more modern incarnation of the Mi-8 series though it debuted at the height of the Cold War period in 1977. Around 12,000 of these have been produced for the Soviets/Russians as well as global allies and customers.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi17.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/06ec8a842eb749bd96ac1fbc9e468058/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi-24",
    "model": "Mil Mi-24",
    "country": "Soviet-union",
    "units": 330,
    "role": "Gunship/Transp",
    "assessment": "Aging, Requires Attention",
    "description": "This aging Soviet Cold War-era helicopter design is something of an anomoly over todays battlefields - combining the capabilities of an attack helicopter with those of a transport platform resulting in a true gunship. The Mi-24 seats its crew of two in tandem and is powered by a pair of engines over the fuselage. Under these engines lies a modest passenger space accessed through side-fuselage sliding doors. This allows the gunship to insert and extract combat-ready forces while also supply a hefty offensive punch through cannon pods, rocket pods, and ATGMs at range. Armor protection is centered on crew and systems survivability to further enhance its tactical value. Over 300 Mi-24 helicopters are operated by the Russian Air Force, these alongside the dedicated attack types Ka-52 and Mi-28.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi24.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/dcdd6999334346cb947e03a7528c6c31/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Ka-52",
    "model": "Kamov Ka-52",
    "country": "Russia",
    "units": 127,
    "role": "Atack Helo",
    "assessment": "Modern Solution",
    "description": "The Kamov Ka-52 is an evolved form of the earlier Ka-50 Black Shark. Instead of a single crewman, the attack helicopter seats two in a side-by-side arrangement to spread about the mission workload. A pair of engines power the Kamov siganture co-axial main rotor arrangement which negates use of a traditional tail rotor to counter torque. On the wingstubs can be mounted various cannon pods, rocket pods, and ATGMs across three hardpoints to a wing. A fixed cannon is also featured for destruction of infantry and light-armored vehicle elements. The adoption of the more versatile Ka-52 meant the end of the Ka-50 in Russian Air Force service.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/ka52.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/6f29175ef23940fcb4c5364240e169f7/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi-28N/NM",
    "model": "Mil Mi-28",
    "country": "Russia",
    "units": 95,
    "role": "Atack Helo",
    "assessment": "Modern Solution",
    "description": "The Mil Mi-28 Havoc is the second of two (the other being the Ka-52) dedicated attack helicopter types fielded by the modern Russian Air Force. It has qualities more akin to the American AH-64 Apache design complete with stepped tandem seating for its crew of two and a twin-engine arrangement for power. Unlike the Ka-52, the Mi-28 relies on a traditional single main rotor with conventional rotor unit. Like other attack helos, the Mi-28 seats its armament options along a pair of wingstubs and has access to all current Russian Air Force ordnance related to the CAS role.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi28.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/e6d8e1c9346d416189dfeac64eec62b2/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Ansat-U",
    "model": "Kazan Ansat",
    "country": "Russia",
    "units": 50,
    "role": "Light Utility",
    "assessment": "New Procurement",
    "description": "Around 50 Kazan Ansat light utility helicopters make up the Russian Air Force fleet. This is design ia all-modern with a similay appearance - and battlefield function - to the American Bell 206 series. The undercarriage is of a fixed-skid arrangment and the cockpit seats two side-by-side with a passenger area aft (and under the engine installation). The main rotor sits over the design and a conventional tail rotor is in play as an anti-torque measure. The helicopter is utilized in light utility roles for its part.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/ansat.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/12db9ed5393f47409d2791847f0d6622/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi26/T",
    "model": "Mil Mi-26",
    "country": "Soviet-union",
    "units": 44,
    "role": "Heavy-Lift",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "Russia is one of the dwindling list of global operators of the mammoth Mil Mi-26 heavy-lift transport helicopter. The design is a holdover of the deep Cold War period and flew for the first time on December 14th, 1977. Formal introduction was had in 1983 and only 315 were constructed from 1980 on. The value of the Mi-26 system is in VTOL of very-heavy-loads and can be equally effective in humanitarian sorties as it is in troop resupply, ferrying, or artillery relocation. Two engines power the type and its design is conventional with a main rotor unit and tail rotor unit (facing starboard)",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi26.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/272597d721e74a45914f7ffb846dda2a/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Ka-226",
    "model": "Kamov Ka-226",
    "country": "Russia",
    "units": 36,
    "role": "Light Utility",
    "assessment": "Modern Solution",
    "description": "The Kamov Ka-226 is another one of the more modern helicopter offerings operated by the Russian Air Force. This design is restricted to the light utility role and some 269 total airframes have been completed since 1996. It is a further development of the Ka-126  of the late 1980s. The Ka-226 itself flew for the first time in 1997 and was introduced in 2002. It uses the siganture Kamov coaxial main rotor approach which negates the use of a conventional tail rotor. The undercarriage, while all-wheeled, is fixed in flight.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/ka226.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "Ka-27",
    "model": "Kamov Ka-27",
    "country": "Russia",
    "units": 6,
    "role": "ASW",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "While the Kamov Ka-27 is a fixture of Russian Naval actions, the Russian Air Force employs the services of six of the Anti-Submarine Warfare (ASW) platforms. These were taken on in 1982 and utilized a co-axial main rotor, twin tail fins, and side-by-side cockpit seating with a passenger cabin aft. The undercarriage is wheeled though fixed in flight. Production of the Ka-27 ran from 1979 until 2010 and series introduction was formally had in 1982. The Ka-31 is a major offshoot of the type while the Ka-27, itself, was born from work had in the earlier Ka-25.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/ka27.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/dbb0bf12dda84bf1b3f30a43bdbd5752/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "AS350/355",
    "model": "Eurocopter AS350/AS355",
    "country": "France",
    "units": 5,
    "role": "Light Utility",
    "assessment": "Aging, Requires Attention",
    "description": "Prior to the Russian invasion of Ukraine, the former secured a modest fleet of five Eurocopter (now Airbus Helicopters) AS350/AS535 Ecureuil light utility helicopters. The French design flew for the first time in June of 1974 and was introduced in 1975 finding many global supporters since. Variants include the Fennec and Ecureuil 2 as well as the EC130 and Chinese Z-11 types. These designs are restricted to ligth utlity roles though some have been armed for a limited attack functionality as needed. To keep maintenance and repair commitments to a minimum, the helicopter utilizes a simple three-bladed main rotor with two-bladed tail rotor and fixed landing skids.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/as350.webp",
    "flag_url": "flags/france.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/b4884fa65da445d9bdf6b2c3767a829e/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi-38T",
    "model": "Mil Mi-38",
    "country": "Russia",
    "units": 2,
    "role": "Medium Utility",
    "assessment": "New Procurement",
    "description": "The Mil Mi-38 is the future medium-lift transport of the Russian Air Force. Introduced in 2019, the fleet numbers just two air frames today with an additional two on order. The helicopter completed its first-flight in December 2003 and was formally introduced through the Mi-38T production model in 2019. A total of 13 air frames have been completed with four of these serving as test beds. In Russian Air Force service, the Mi-38 is intended to succeed both the Mi-8 and Mi-17 types.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi38.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/9c550a10eb2946879a405e66fa206321/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-76M/MD/MDM",
    "model": "Ilyushin Il-76",
    "country": "Soviet-union",
    "units": 120,
    "role": "Strat.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Ilyushin Il-76 is a Soviet Air Force mainstay still operated in considerable numbers by the modern Russian Air Force. Some 120 make up the toal fleet with a further 20 air frames of a modern type on order. The massive heavy hauler makes use of a swept-back wing mainplane, deep fuselage, T-style tail unit and four powerful non-afterburning jet engines. The original design emerged in 1971 when it was flown for the first time, leading to production commencing for a 1974 introduction. Over 950 of the type have been produced since 1971 with more modern forms having taken the place of the original offerings. Notable variants of this aircraft include the IL-78, Beriev A-50, and KJ-2000 marks.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il76.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/75e84cc17f5d4e7784e33be70fe68865/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "An-26",
    "model": "Antonov An-26",
    "country": "Soviet-union",
    "units": 116,
    "role": "Tact.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Antonov An-26 twin-turboprop serves as a tactical-level transport. It was adopted in 1970 and some 116 make up the current active stock of the nearly 200 or so available. The series got its start in prototype form during may of 1969 and was a further development of the Antonov An-24 line. The An-26 was, itself, developed into the An-32. Total production for the Soviet Air Force and allied customers reached 1,159 units built from 1969 to 1986. Despite its Cold War-era roots, the design continues to soldier on for global players today.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an26.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/de08277743dc44d696e357ee8bb80b59/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "An-12B/BK",
    "model": "Antonov An-12",
    "country": "Soviet-union",
    "units": 56,
    "role": "Tact.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Antonov An-12 is a quadruple turboprop-engined tactical-level transport flown for the first time in 1957. Service entry followed a short time later in 1959 and, from 1957 to 1973, 1,248 air frames were completed. The design has roots in the earlier Antonov An-10 (also debuting in 1959) and continues to soldier on in Russian Air Force service despite its deep Cold War roots. The Chinese Shaanxi Y-8 is a local copy of this Soviet design.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an12.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/421f6eda1b724d1b9771468f17365254/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Tu-134",
    "model": "Tupolev Tu-134",
    "country": "Soviet-union",
    "units": 55,
    "role": "Transport",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Tupolev Tu-134 is a versatile twin-engined passenger airliner operated by the modern Russian Air Force in the transport, training, and patrol roles. The design was adopted in 1967 while there was still a Cold War being fought by East and West. The original form took to the air for the first time in July 1963 and service introduction followed September 1970. Production ran from 1966 to 1989 to which 854 total aircraft were completed including the two original prototypes. The aircraft itself is a further evolution of the earlier Tupolev Tu-124 passenger airliner of the early 1960s.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu134.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/7481cb759ffb4e6d8f8a5cd9855c760c/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "L-410",
    "model": "LET L-410 Turbolet",
    "country": "Czechoslovakia",
    "units": 43,
    "role": "Tact.Transp",
    "assessment": "Aging, Requires Attention",
    "description": "The LET L-410 Turbolet is a product of the former Czechoslovakia and was adopted in 1970. The design has proven itself as a versatile high-winged, twin-turboprop platform as over 1,200 airframes have been completed since 1971. Between 40 and 50 aircraft make up the current active Russian Air Force stock.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/l410.webp",
    "flag_url": "flags/czechoslovakia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/38c3aaea4de54eb1a20634586c2a215f/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "An-72/P",
    "model": "Antonov An-72 (Coaler",
    "country": "Soviet-union",
    "units": 29,
    "role": "Tact.Transp",
    "assessment": "Aging, Requires Attention",
    "description": "The Antonov An-72 is a Soviet product of the Cold War period. While given high-mounted, swept-back mainplanes and a T-style tail, the most unique aspect of this tactical-level airlifter is its over-wing mounted turbojet engines. The prototype went to the air for the first time in August 1977 and serial production followed soon after. One-hundred ninetry-five airframes have been produced since then with notable offshoots becoming the An-71 and An-74 marks. The modern Russian Air Force still operates these Cold Warriors in about 30 active examples.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an72.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "Tu-154",
    "model": "Tupolev Tu-154",
    "country": "Soviet-union",
    "units": 19,
    "role": "Transport",
    "assessment": "Aging, Requires Attention",
    "description": "The Tupolev Tu-154 is a trijet passenger airliner of the deep Cold War period. A first flight of the prototype form was recorded in 1968 and series adoption took place with Aeroflot in February 1972. From 1968 until 2003, 1,026 aircraft were completed by Tupolev. Notable variants include the one-off Tu-155. The Russia Air Force has a stock of about 20 of these jets though as few as 3 may be in active service.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu154.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/96cbe2cdd9ca40d3ab5e9789e2b819d7/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "An-148",
    "model": "Antonov An-148",
    "country": "Ukraine",
    "units": 15,
    "role": "VIP",
    "assessment": "Modern Solution",
    "description": "The Antonov An-148 is a high-winged twin-jet powered tactical transport / regional airliner of Ukrainian origin. The aircraft was taken on by the Russian Air Force before the 2022 invasion, resulting in some 15 making their way into Russian service. While a first-flight took place in 2004, series adoption arrived in 2009. Without support and access to approved spares, the series may be jeopardized in terms of active participation in the near-future.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an148.webp",
    "flag_url": "flags/ukraine.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/7a3343ff5c12429baa4d8dbb7a9c4a13/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-18D/V",
    "model": "Ilyushin IL-18",
    "country": "Soviet-union",
    "units": 8,
    "role": "Transport",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "Another Cold War era holdover serving the modern Russian Air Force is the Ilyushin Il-18. These serve in limited numbers in the transport role. Series adoption of the quadruple-engined airliner took place in 1958 with as few as three in active service today with Russia. Models in focus are the D and V offerings.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il18.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/dbaeb6d5138448b7b47b9006dc5f244d/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-62M",
    "model": "Ilyushin IL-62",
    "country": "Soviet-union",
    "units": 7,
    "role": "VIP",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "A fleet of 7 Ilyushin IL-62 quadruple-jet airliners serve the modern Russian Air Force in the VIP transport role. The aircraft is a relic of the deep Cold War period, first flying in 1963 and entering service in 1967. The Il-67M derivative followed in 1974. Production of this swept-wing passenger hauler ran from 1963 until 1995.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il62.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/d2e1a0e176124f19863d60e31a3437e1/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "An-22A",
    "model": "Antonov An-22 (Antei",
    "country": "Soviet-union",
    "units": 5,
    "role": "Tact.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Russian Air Force keeps on hand 5 of the massive Soviet-era Antonov An-22A variant aircraft to serve a strategic airlifter / transport role. The aircraft flew for the first time in 1965 and was introduced in 1967. Just 68 were manufactured by Antonov. Beyond its size, notatable qualities include a quadruple turboprop engine array, straight, shoulder-mounted mainplanes, and a large-area twin-ruddered tail uni. The rear of the fuselage is elevated to facilitate movement of cargo to and from the hold of the transport. The aircraft are very expensive to operate and maintain and age has not done the line any favors.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an22.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/291cbafe52314c159d0c80a17aa48eef/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "An-140-100",
    "model": "Antonov An-140",
    "country": "Ukraine",
    "units": 5,
    "role": "Tact.Transp",
    "assessment": "Modern Solution",
    "description": "The Antonov An-140 is a Ukrainian high-winged, twin-turboprop regional airliner that first flew in 1997 and was introduced in 2002. From 1997 to today, just 33 airframes have been completed of this rugged, versatile type. The Russian invasion of Ukraine in February 2022 terminated any future orders and direct support of the aircraft, leading local Russian industry to bear the brunt of future repairs, maintenance, and replacement. The model in focus is the An-140-100 and these operate in a general utility transport role within the inventory of the Russian Air Force.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an140.webp",
    "flag_url": "flags/ukraine.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/7a3343ff5c12429baa4d8dbb7a9c4a13/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "An-124-100",
    "model": "Antonov An-124",
    "country": "Soviet-union",
    "units": 4,
    "role": "Strat.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "For the Soviets during the Cold War period, bigger was always better. This proved the case with the massive Antonov An-124 Ruslan heavy strategic transport powered by no fewer than four jet engines set under a swept-back mainplane. The aircraft was given a deep and accessible fuselage for moving man, machine, and cargo in and out of the hold. Supporting the aircraft when ground-running is a line of multiple bogies under center mass - such is the weight of this beast. The design flew for the first time in 1982 and was adopted in 1986. Just 55 of the type were produced from 1982 to 2004 by Antonov. The Antonov An-225 is an offshoot of the An-124.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an124.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/70bc72ce8ec2421f9b7ec004d1ec7c7b/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-78M",
    "model": "Ilyushin IL-78/M",
    "country": "Soviet-union",
    "units": 18,
    "role": "Aerial Tanker",
    "assessment": "Aging, Requires Attention",
    "description": "The Ilyushin IL-78 quadruple jet-engined aircraft continues to serve modern Russian Air Force aircraft in the aerial tanker role. The IL-78 is the original production form based in the IL-76MD cargo hauler. The IL-78M is a modernized form arriving in 1987. The series has been further modernized in the IL-78M2 though these are available in only very limited quantitues to date.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il78.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/0dd124572e3148d1ba89689513e03a5b/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-22/M",
    "model": "Ilyushin IL-22 (Coot-B",
    "country": "Soviet-union",
    "units": 17,
    "role": "Airborne Command",
    "assessment": "Aging, Requires Attention",
    "description": "The IL-22 and IL-22M forms are optimized for, and operated in, the airborne Command and Control (C2) / Command Post role. Some 18 airframes make up the current Russian Air Force stock. The aircraft is from the long line of Cold War-era quadruple straight-wing aircraft born in the Ilyushin IL-18 series. The M-model mark designates a more modern equipment set installed. The Ilyushin IL-18 platform is an aging design rooted in the deep Cold War period, the prototype first-flying in 1957. From then until 1985, over 650 aircraft were produced by Soviet aero-industry. The IL-38 is another one of its famous offshoots. One IL-22 was lost to Ukrainian air defenses in January of 2024.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il18.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "An-30",
    "model": "Antonov An-30",
    "country": "Soviet-union",
    "units": 15,
    "role": "Reconnaissance",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an30.jpg",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "A-50/U",
    "model": "Beriev A-50 (Mainstay",
    "country": "Soviet-union",
    "units": 13,
    "role": "AWACS",
    "assessment": "Aging, Requires Attention",
    "description": "The Beriev A-50 serbes the Russian Air Force in the AWACS role, providing critical real-time information to allied warplanes, commanders, and warplanners. The fleet was made up of at least 15 airframes with seven of these have been modernized to the U-model standard. The A-50 is a Soviet-era design first-flying in December 1978 and introduced in 1985. About 40 or so airframes were completed from 1978 to 1992. The airframe itself is the Ilyushin IL-76 quadruple heavy aircraft with specialized equipment carried internally and a radome installed over the dorsal line. The Beriev A-100 model is its evolution. One example was lost to Ukrainian air defenses in January of 2024.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/a50.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-20/M",
    "model": "Ilyushin IL-20 (Coot-A",
    "country": "Soviet-union",
    "units": 12,
    "role": "SIGINT",
    "assessment": "Modern Solution",
    "description": "The Ilyushin IL-20  and IL-20M serve the modern Russian Air Force in the SIGINT and ELINT roles, the M-model designating newer mission equipment installed. The fleet numbers 12 active air frames. Like other special mission platforms operated by the service, the IL-20 is built upon the proven framework of the 1950s-era IL-18 quadruple-engined design. The IL-22 Coot-B is also based in this design but fulfills the Command and Control (C2) role.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il20.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "An-12PP",
    "model": "Antonov An-12",
    "country": "Soviet-union",
    "units": 4,
    "role": "Radar Jamming",
    "assessment": "Aging, Requires Attention",
    "description": "At least 4 Antonov An-12PP platforms - developed from the Antonov An-10 - are operated in the active radar jamming role by the Russian Air Force. The quadruple-engined airframe is granted excellent loitering capabilities through its high-winged turboprop arrangement and flew for the first time in 1957, adopted a short time later in 1959. As such, this is yet-another airframe rooted in Cold War-era doctrine and design. Production spanned from 1957 until 1973 yielding 1,248 total aircraft. The Chinese Shaanxi Y-8 is a notable offshoot of this aircraft line.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an12.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/421f6eda1b724d1b9771468f17365254/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Tu-214ON/PU",
    "model": "Tupolev Tu-214",
    "country": "Russia",
    "units": 4,
    "role": "Reconnaissance",
    "assessment": "Modern Solution",
    "description": "The Russian Air Force operates a fleet of four Tupoelv Tu-214 twin-jet powered passenger airliners in the reconnaissance role. As such, these special-mission platforms carry equally-special mission equipment. The models in play are the Tu-214ON and Tu-214 PU-SBUS marks. These military-minded aircraft retain all of thier excellent operational range and useful performance specs.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu214.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/3acbd21815b14758a3e0d48e1ff82233/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-80",
    "model": "Ilyushin IL-80 (Maxdome",
    "country": "Soviet-union",
    "units": 3,
    "role": "Airborne Command",
    "assessment": "Modern Solution",
    "description": "The Ilyushin IL-80 are three airliners outfitted for the Airborne Command Post role. The design is noted for its front dorsal fairing added but retains much of the form and function of the IL-86 passenger airliner which carries four jet engines along a swept-back wing mainplane. Just four of these massive aircraft were built for Russian Aerospace Forces and first flowin in 1987. Series introduction was had in 1992.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-22PP",
    "model": "Ilyushin IL-22",
    "country": "Soviet-union",
    "units": 3,
    "role": "Radar Jamming",
    "assessment": "Aging, Requires Attention",
    "description": "Three Ilyushin IL-22 aircraft are outfitted for the radar jamming role and flown in the IL-22PP guise. The IL-22, itself, is an offshoot of the Ilyushin IL-18 quadruple turboprop platform of the Cold War period. The series also includes the IL-20 showing the base versatility inherent in this Ilyushin design.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il18.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/6ba63e06628e491a9836e4a9c54c50f1/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Tu-214R",
    "model": "Tupolev Tu-214",
    "country": "Russia",
    "units": 2,
    "role": "SIGINT",
    "assessment": "Modern Solution",
    "description": "The Tupolev Tu-214R is another SIGINT/ELINT platform in active service with the Russian Air Force. The fleet numbers two. The aircraft is based in the Tu-204 twin-jet-powered narrow-body airliner born in the late-Soviet years but not introduced until 1996 with carrier Vnukovo Airliners. Production of the series has been ongoing since 1990 though fewer than 100 airframes in the series have been completed for various customers.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu214.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/3acbd21815b14758a3e0d48e1ff82233/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-82",
    "model": "Ilyushin IL-82",
    "country": "Soviet-union",
    "units": 1,
    "role": "Airborne Command",
    "assessment": "Modern Solution",
    "description": "",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il76.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "IL-78M2",
    "model": "Ilyushin IL-78",
    "country": "Russia",
    "units": 1,
    "role": "Aerial Tanker",
    "assessment": "New Procurement",
    "description": "The Russian Air Force has acquired a single IL-78M2 to date. This is a wholly-modernized version of the IL-78M aerial tanker form which still contributes critical in-flight services for allied warplanes. M-models entered service in 1987 just as the Soviet Empire was about to collapse. In its modernized form, the aircraft was revealed in August of 2019.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il78.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/0dd124572e3148d1ba89689513e03a5b/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "M-55",
    "model": "Myasishchev M-55",
    "country": "Soviet-union",
    "units": 1,
    "role": "Reconnaissance",
    "assessment": "Aging, Requires Attention",
    "description": "The Myasishchev M-55 is a rather unique aircraft in the inventory of the modern Russian Aerospace Forces, fulfilling a high-altitude reconnaissance role similar to that of the USAF Lockheed U-2 spyplane. The single-seat, twn-engine monoplane has a twin-boom design with high-mounted, shared horizontal plane. It flew for the first time in December 1978 and was adopted in its M-17 form during May of 1982. The M-55 model followed in August of 1988 just prior to the fall of the Soviet Union. One prototype was completed and this was followed by a pair of single-engined M-17s and about 5 M-55s.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "L-39",
    "model": "Aero L-39 Albatros",
    "country": "Czechoslovakia",
    "units": 210,
    "role": "Advance Jet Trainer",
    "assessment": "Aging, Requires Attention",
    "description": "The Cold War-era Czech-originated Aero L-39 Albatros still serves modern Russian aviation in considerable numbers. The light strike / Advanced Jet Trainer (AJT) platform was debuted through a first-flight in 1968 and introduced in 1972 with the Czechoslovakian Air Force. From 1971 to 1996 there were over 2,500 of the type produced (production has since been restarted in 2023). The A-39 is an evolution of the earlier L-29 and includes the L-39NG, L59 Super Albatros, and L-159 ALCA offshoots. For its part, Russian aviation stocks the aircraft in its Air Force and Navy services.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/l39.webp",
    "flag_url": "flags/czechoslovakia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/8add6f716b79418885bb9122f404c983/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Yak-130",
    "model": "Yakovlev Yak-130 (Mitten",
    "country": "Russia",
    "units": 111,
    "role": "Advance Jet Trainer",
    "assessment": "New Procurement",
    "description": "The Yakovlev Yak-130 (Mitten) is the principle Advanced Jet Trainer (AJT) operated in number by the Russian Air Force. It succeeds an aging line of Czech-originated Aero L-39 Albatros light aircraft in same role. The aircraft shares a straight-wing monoplane, two-seat, twin-engine design as its forerunner but brings along an advanced cockpit setting and enhanced performance. AJTs help to bridge the education gap between basic / advanced prop-driven designs and high-performance combat jets. The Yak-130 can also double as a light-attack platform, such is its versatility. Over 185 airframes have been completed to date. The Italian M-346 Master is rooted in this modern Russian design.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/yak130.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "AIR FORCE",
    "name": "Tu-134UBL",
    "model": "Tupolev Tu-134",
    "country": "Soviet-union",
    "units": 37,
    "role": "Crew Trainer",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu134.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/7481cb759ffb4e6d8f8a5cd9855c760c/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "DA42T",
    "model": "Diamond DA42",
    "country": "Austria",
    "units": 35,
    "role": "Flight Trainer",
    "assessment": "Modern Solution",
    "description": "The Russian Air Force managed to secure a stock of the Austrian Diamond DA42 light aircraft prior to its invasion of neighboring Ukraine in February 2022. These General Aviation platforms are used in the basic flight training role, introducing future airmen to the intricasies of heavier-than-air powered flight. The aircraft seats two side-by-side with additional seating aft and is powered by a pair of engines seated outboard of the streamlined fuselage design. The prototype flew for the first time in December 2002 and was introduced to the market in 2004. Production has been ongoing since 2002 yielding hundreds of air frames delivered to various global customers.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/da42.webp",
    "flag_url": "flags/austria.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/90ed9e429c434ae7b76a3135dc5a5729/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi-2",
    "model": "Mil Mi-2 (Hoplite",
    "country": "Poland",
    "units": 29,
    "role": "Helo Trainer",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Mil Mi-2 Hoplite light utility aircraft was acquired from the Polish Peoples Republic (PZL-Swidnik) and operated through 29 active examples by the modern Russian Air Force in the helicopter training role. The original design was first flown in September 1961 and introduced in 1965. Nearly 5,500 were built into 1998 with key operators being the Soviet Air Force and Polish Armed Services. Aeroflot also took delivery of the type. The design went on to find many global takers and various over-battlefield roles, such was its ease-of-operation and versatiliy. This aging helicopter, however, is seeing more and more retirements occurring around the globe with its best flying days clearly behind it.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi2.webp",
    "flag_url": "flags/poland.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/395cd272bd594f41bdd93f81f1aabb12/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Su-30M2",
    "model": "Sukhoi Su-30 (Flanker",
    "country": "Russia",
    "units": 19,
    "role": "Combat Trainer",
    "assessment": "Modern Solution",
    "description": "Of the entire stock of 110 Su-30 Flanker fighters operated by the Russian Air Force, 19 Su-30M2 models are reserved for combat training purposes to introduce aspiring airmne to the intricasies of this modern fighter design. The Su-30 is a two-seat version of the Su-27 single-seat, twin-engine air superiority type. First-flying in 1989, the Su-30 was adopted in 1996 and various marks have been born from the base, effective fighter platform.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su30.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/92ca062c90fd45ffb6ce8144dc46004a/embed"
  },
  {
    "service": "AIR FORCE",
    "name": "Mi-28UB",
    "model": "Mil Mi-28",
    "country": "Russia",
    "units": 12,
    "role": "Atk.Helo Trainer",
    "assessment": "Modern Solution",
    "description": "The specialized role of the Mil Mi-28 twin-seat, twin-engine attack helicopter requires specialized training for up-and-coming airmen. A fleet of 12 are reserved for this purpose with the Russian Air Force. The Mi-28 is one of two dedicated attack helicopter platforms operated by the service, the other being the Kamov Ka-52 Alligator. These are further fielded alongside the venerable Mil Mi-24 Hind gunship-transport types providing for considerable CAS capabilities when supporting ground forces. The Mi-28UB serves as a flying classroom of sorts, introducing both pilots and weapons operators to detailed operation of the various systems and subsystems of the advanced helicopter design. As such, the UB-model retains most of the combat capabilities of the straight-forward combat models in service.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi28.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/e6d8e1c9346d416189dfeac64eec62b2/embed"
  },
  {
    "service": "NAVY",
    "name": "Su-27",
    "model": "Sukhoi Su-27 (Flanker",
    "country": "Soviet-union",
    "units": 53,
    "role": "Air Superiority",
    "assessment": "Aging, Requires Attention",
    "description": "Despite its 1985 adoption year, the Sukhoi Su-27 Flanker continues in service with Russian Naval Aviation through some 53 total air frames. These aircraft retain all of their agility, performance power, and access to medium- and long-ranged Soviet-Russian aerial weaponry.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su27.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/19fb0bc56cdf40b0a611f9c4fee16ef0/embed"
  },
  {
    "service": "NAVY",
    "name": "Su-33 (Su-27K)",
    "model": "Su-27K",
    "country": "Russia",
    "units": 35,
    "role": "Air Superiority",
    "assessment": "Aging, Requires Attention",
    "description": "The Sukhoi Su-33 (Flanker-D) is a navalized version of the classic Soviet Su-27 Flanker air superiority fighter developed to operate from Soviet carrier decks as well as land bases. The original form went airborne for the first time in 1987 but was not officially adpted until after the fall of the Soviet Empire in 1998. From 1987 until 1989 fewer than 35 were produced to the standard which included folding wings, a reinforced undercarriage, and an arrestor hook. The Su-33 was originally known as the Su-27K. The Chinese Shenyang J-15 is based in the Soviet-Russian Su-33 model.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su33.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/b355182c980e4e53958956a56fa91f2e/embed"
  },
  {
    "service": "NAVY",
    "name": "Su-30/SM/SM2",
    "model": "Sukhoi Su-30 (Flanker",
    "country": "Russia",
    "units": 34,
    "role": "Multirole",
    "assessment": "New Procurement",
    "description": "Thirty-four total aircraft make up the Su-30 fleet of Russian Naval Aviation. Of this count, 22 are of the Su-30SM mark and 12 make up the newer Su-30SM2 type.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su30.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/92ca062c90fd45ffb6ce8144dc46004a/embed"
  },
  {
    "service": "NAVY",
    "name": "MiG-31B/BS/BM",
    "model": "Mikoyan MiG-31 (Foxhound",
    "country": "Soviet-union",
    "units": 32,
    "role": "Interceptor",
    "assessment": "Aging, Requires Attention",
    "description": "Russian Naval Aviation operates a healthy stock of Mikoyan MiG-31 Foxhound high-speed interceptors. Despite their Cold War-era roots, these platforms remain highly lethal in their performance-based interception of inbound aerial threats with their primary armament scheme involving variable-range missiles. The fleet numbers 32 at present. The design is centered on a two-seat (tandem) cockpit arrangement with side-by-side afterburning turbofan engines. The original design debuted in 1981 and 519 aircraft were built in the series from 1975 until 1994, primarily for the Soviet Air Force. Models in play are 10 of the B and BS types and 22 of the BM mark.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mig31.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/37965bf2b35e4f9596472a5fdf05eb57/embed"
  },
  {
    "service": "NAVY",
    "name": "MiG-29KR/KUBR",
    "model": "Mikoyan MiG-29 (Fulcrum",
    "country": "Soviet-union",
    "units": 22,
    "role": "Multirole",
    "assessment": "Modern Solution",
    "description": "The Mikoyan MiG-29K is the navalized version of the land-based MiG-29 Fulcrum lightweight air superiority / multirole fighter of the Soviet era. The series was introduced in 2010 after a protracted development period (which included the downfall of the Soviet Empire) and is currently operated in its KR and KUBR guises. Just 81 of the design were completed by Mikoyan for the Russian and Indian navies with production ongoing since 2005. The MiG-29K helped to influence the more advanced MiG-35 series beginning to take shape with the Russian Air Force. Interestingly enough, the MiG-29K was passed over by the Russian Navy seelction of the Su-27K (becoming the Su-33). However, age has begun to catch up with the Sukhoi design resulting in the Russians adopted the MiG-29K as its direct replacement.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mig29.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/d39e0996596948e59935ab465efb42ee/embed"
  },
  {
    "service": "NAVY",
    "name": "Su-24",
    "model": "Sukhoi Su-24 (Fencer",
    "country": "Soviet-union",
    "units": 22,
    "role": "Strike",
    "assessment": "Aging, Requires Attention",
    "description": "Like its Air Force counterpart, Russian Naval Aviation also operates the Cold War-era Sukhoi Su-24 (Fencer) in the direct-attack / supersonic strike role. The aircraft is distinguished from traditional forms by its side-by-side cockpit and swing-wing mainplanes. It makes use of a twin engine configuration to achieve desired high-speed performance. Part of the Su-24 attack pattern is approaching fast-and-low to avoid enemy radar, popping up only to deliver a potent warload. The series was adopted in 1985 and some 22 currently make up the Russian Navy fleet.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su24.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/f389c42519c2409fa13702c0f8e92d96/embed"
  },
  {
    "service": "NAVY",
    "name": "Su-25UTG",
    "model": "Sukhoi Su-25 (Frogfoot",
    "country": "Soviet-union",
    "units": 4,
    "role": "CAS",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Sukhoi Su-25 (Frogfoot), a staple of the Russian Air Force attack capability, sees operation also with Russian Naval Aviation though in just a modest collection of four aircraft. While these can be used for general attack and CAS sorties, they also serve as trainers due to the specific performance and tactics required of this low-and-slow performer. Service entry was had in 1988 and the Su-25UTG is the current mark in play.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/su25.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/a17e07be737b4d0c8d359949662a90a9/embed"
  },
  {
    "service": "NAVY",
    "name": "Ka-27",
    "model": "Kamov Ka-27 (Helix",
    "country": "Soviet-union",
    "units": 90,
    "role": "ASW",
    "assessment": "Aging, Requires Attention",
    "description": "The Kamov Ka-27 Helix is the primary helicopter operated by Russian Naval Aviation. Adopted in 1982, some 90 make up the current fleet. These are utilized (and optimized for) the Anti-Submarine Warfare (ASW) role with general patroling actions being part of the sortie capability. The helicopters make use of the Kamov stable stacked (co-axial) main rotor arrangement which negates the need for a conventional tail rotor to offset torque effects. Developed from the Kamov Ka-25 series, the Ka-27 has since generated its own batch of related offshoots for the Russians. A first-flight was recorded in December 1973 during the Cold War period and series introduction took place in 1982. Production ended in 2010.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/ka27.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/dbb0bf12dda84bf1b3f30a43bdbd5752/embed"
  },
  {
    "service": "NAVY",
    "name": "Mi-8",
    "model": "Mil Mi-8 (Hip",
    "country": "Soviet-union",
    "units": 11,
    "role": "Medium-Lift",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "Fewer than a dozen or so Mil Mi-8 Hip transport-gunship helicopters are operated by Russian Naval Aviation. These serve in the general transport role where their power and performance is a proven commodity. Series adoption took place in 1967 yet this Cold War-era medium-lift design continues to soldier on in number with multiple air powers around the globe.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi17.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/3d0846c32cd249e6a56f714b4f5d4437/embed"
  },
  {
    "service": "NAVY",
    "name": "Ka-29",
    "model": "Kamov Ka-29 (Helix-B",
    "country": "Soviet-union",
    "units": 10,
    "role": "ASW",
    "assessment": "Aging, Requires Attention",
    "description": "The Kamov Ka-29 Helix-B is an assault-minded armored helicopter form based in the earlier Ka-27 ASW platform. This version has an operating crew of two and can ferry up to 16 combat-ready troops where needed. The helicopter is armed through gun pods, cannon pods, drop bombs, rockets, and Anti-Tank Guided Missile (ATGM) solutions as needed. Series adoption took place in 1982.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "Ka-31",
    "model": "Kamov Ka-31 (Helix",
    "country": "Russia",
    "units": 3,
    "role": "AWACS",
    "assessment": "Modern Solution",
    "description": "The Kamov Ka-31 is operated through a trio of airframes by Russian Naval Aviation optimized for the AWACS role. Series adoption took place in 1995. From 1985 until today, just 28 of the type have been produced with key customers being Russia, India, and China. It is born from the versatile Cold War-era Kamov Ka-27 Helix platform and, thus, shares its general arrangement and performance capabilities.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "Ka-52K",
    "model": "Kamov Ka-52 (Alligator",
    "country": "Russia",
    "units": 3,
    "role": "Attack Helo",
    "assessment": "Modern Solution",
    "description": "The Kamov Ka-52 Alligator is the twin-seat (side-by-side), twin-engine form of the earlier Cold War-era Ka-50 Black Shark attack helicopter. As a Kamov design, it utilizes a coaxial (stacked) twin main rotor design to cancel the inherent effects of torque (thus negating the use of a traditional tail rotor unit). For its part, Russian Naval Aviation operates a limited fleet of just 3 Ka-52K models in the attack role.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/ka52.webp",
    "flag_url": "flags/russia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/04650bd1eee04f7e8cb82101e0dca0a8/embed"
  },
  {
    "service": "NAVY",
    "name": "Ka-28",
    "model": "Kamov Ka-28 (Helix",
    "country": "Soviet-union",
    "units": 2,
    "role": "ASW",
    "assessment": "Aging, Requires Attention",
    "description": "The Kamov Ka-28 is the export version of the Ka-27PL which is modified for the Anti-Submarine Warfare (ASW) role. As such, it shares the same form-and-function with the original including the co-axial main rotor design and specialized mission equipment for the role. Just two are operated in the active Russian Naval Aviation inventory.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/dbb0bf12dda84bf1b3f30a43bdbd5752/embed"
  },
  {
    "service": "NAVY",
    "name": "Mi-24",
    "model": "Mil Mi-24 (Hind",
    "country": "Soviet-union",
    "units": 2,
    "role": "Attack Helo",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "Russian Naval Aviation operates just two of the venerable Mil Mi-24 twin-seat (tandem), twin-engine (side-by-side) gunship-helicopters for its part. These were adopted in 1972 and retain all of their attack and transport capabilities - the principle quality being the latter which allows the helicopter to ferry a squad of combat-ready troopers under protection while the helicopter supplies CAS firepower once the troopers are disembarked.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/mi24.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/b83b9088b6e3480e87b6305ab27e2887/embed"
  },
  {
    "service": "NAVY",
    "name": "An-26",
    "model": "Antonov An-26 (Curl",
    "country": "Soviet-union",
    "units": 26,
    "role": "Tact.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "Over two dozen active Antonov An-26 tactical transports are operated by modern Russian Naval Aviation. These are used in the general transport role. and were adopted in 1970. The original series prototype went airborne for the first time in May 1969 and over 1,400 airframes were completed by Antonov for the Soviet Air Force, Paskitan, Vietnam and others. The aircraft continues to soldier on by way of its versatile reliable design that features outboard turboprops and a high-wing / straight wing mainplane for excellent low-and-slow flight characteristics and short-field / rough-field performance. The An-26 was a further development of the An-24 platform and, itself, became the foundation for the An-32 model.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an26.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/de08277743dc44d696e357ee8bb80b59/embed"
  },
  {
    "service": "NAVY",
    "name": "Tu-134",
    "model": "Tupolev Tu-134 (Crusty",
    "country": "Soviet-union",
    "units": 6,
    "role": "Transport",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Tupolev Tu-134 twin-jet passenger airliner is utilized by Russian Naval Aviation in the VIP / transport roles. There are six in the current fleet and the series entered service in 1967 during the deep Cold War period. The prototype went airborne in July 1963 and carriers such as Aeroflot and Air Koryo called the Tu-134 into their inventories. The Soviet Air Force also became a primary operator. From 1966 to 1989 there were 854 airframes completed (including two prototypes). The Tu-134 is a further evolution of the Tu-124.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu134.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/2e6826aa0f2142cca046e7499305db6a/embed"
  },
  {
    "service": "NAVY",
    "name": "An-72",
    "model": "Antonov An-72 (Coaler",
    "country": "Soviet-union",
    "units": 5,
    "role": "Tact.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Soviet-era Antonov An-72 Coaler is operated by Russian Naval Aviation through a fleet of five aircraft. These were adopted in 1977. The aircraft is unique in its placement of the jet engine propulsion scheme, the twin jets positioned over the mainplanes at the wingroots. This clears the swept-back mainplanes of any low-handing appendages allowing ground crew to move freely about the aircraft. The remainder of the design is highyl conventional complete with a side-by-side seating flightdeck, raised empennage, and T-style tail unit. A first-flight was recorded back in 1977 and production has run since then revealing 195 total airframes completed in both the An-72 and related An-74 guises. The An-71 is another recognized offshoot of the An-72 line.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an72.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "An-140",
    "model": "Antonov An-140",
    "country": "Ukraine",
    "units": 4,
    "role": "Tact.Transp",
    "assessment": "New Procurement",
    "description": "The Antonov An-140 is a turboprop-powered tactical-level airlifer / regional airliner developed by Ukraine and adopted by Russian Naval Aviation well before the Russian invasion of the country in February 2022, this in 2002. Four airframes were taken on. The prototype went airborne in 1997 and from then until today, thirty-three total airframes have been completed. The aircraft benefits from a streamlined fuselage design, conventional tail unit, high-mounted mainplanes, and underslung turboprop engines to promote excellent short-field, low-and-slow flying characteristics. The future of the series in Russian hands, however, remains in doubt as spares and maintenance issues mount without direct Ukrainian support.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/an140.webp",
    "flag_url": "flags/ukraine.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/7a3343ff5c12429baa4d8dbb7a9c4a13/embed"
  },
  {
    "service": "NAVY",
    "name": "An-24",
    "model": "Antonov An-24 (Coke",
    "country": "Soviet-union",
    "units": 1,
    "role": "Tact.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Cold War relic Antonov An-24 (Coke) is still operated in limited number by Russian Naval Aviation with a single active example noted. The original design went airborne for the first time in October 1959 and until 1979, production yielded 1,367 total examples (which include the local Chinese Y-7 offshoot). The An-24 was a prolific design, giving rise to the An-26, An-30, and An-30 types in turn. The aircraft follows tried-and-true design philosphy involving a high-mounted straight wing mainplan and twin underslung turboprop engines to promote excellent low-and-slow qualities.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "IL-18D",
    "model": "Ilyushin IL-18",
    "country": "Soviet-union",
    "units": 1,
    "role": "Tact.Transp",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "A single Ilyushin Il-18 quadruple turboprop airliner serves Russian Naval Aviation in the transport role. The series was adopted back in 1958 while a Cold War was still being fought between East and West. The prototype went airborne in 1957 and, into 1985, over 675 were completed for local and export operations. The Il-38 is a successful offshoot of the same design.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il18.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/dbaeb6d5138448b7b47b9006dc5f244d/embed"
  },
  {
    "service": "NAVY",
    "name": "Tu-154",
    "model": "Tupolev Tu-154",
    "country": "Soviet-union",
    "units": 1,
    "role": "Transport",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Tupolev Tu-154 is a narrow-body passenger jet airliner built from 1968 until 2013 to the tune of 1,026 examples. The Soviets were key operators of the series to which the entrenched design then fell to the Russians after the Soviet collapse in 1989-1991. Series adoption took place in1 970 and a sole example makes its presence known in the Russian Naval Aviation inventory.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/tu154.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/96cbe2cdd9ca40d3ab5e9789e2b819d7/embed"
  },
  {
    "service": "NAVY",
    "name": "Tu-142",
    "model": "Tupolev Tu-142",
    "country": "Soviet-union",
    "units": 24,
    "role": "Maritime Patrol",
    "assessment": "Modern Solution",
    "description": "At least 24 airframes of the Tu-142 Soviet-era turboprop-powered aircraft are operated by Russian Naval Aviation. The series was borin in 1968 through a first-flight and series entry occurred in December of 1972. From 1968 until 1994 100 total airframes were completed for the Soviet Navy and India, the Soviet models eventually falling to the reborn Russian Navy. The large aircraft, granted exceptional range and performance, is operated in the Maritime Patrol / Anti-Submarine Warfare (ASW) role.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/imgNA.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/65c8c982d61048f594e0262f73437021/embed"
  },
  {
    "service": "NAVY",
    "name": "IL-38",
    "model": "Ilyushin IL-38",
    "country": "Soviet-union",
    "units": 21,
    "role": "ASW",
    "assessment": "Aging, Requires Attention",
    "description": "Adopted in 1967, the Ilyushin Il-38 is utilized by Russian Naval Aviation in the Anti-Submarine Warfare (ASW) / Maritime Patrol roles. At least 21 make up the current fleet. The aircraft is one of the major offshoots of the original Ilyushin Il-18 quadruple-turboprop aircraft and retains the general form and function of the earlier design. Over the cockpit is a sensor outcropping that identifies this version. A Magnetic Anomaly Detector (MAD) is also noted at the extreme aft-end of the fuselage (a stinger-like protrusion).",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il38.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/90bf767754a54a80a22eb0eeedc5ee0d/embed"
  },
  {
    "service": "NAVY",
    "name": "Be-12",
    "model": "Beriev Be-12",
    "country": "Soviet-union",
    "units": 6,
    "role": "Maritime Patrol",
    "assessment": "Aging, Requires Attention",
    "description": "The Beriev Be-12 is a flying boat operated by Russian Naval Aviation in the patrol role. These aircraft are granted excellent range through their twin prop design with the boat-like hull and underwing pontoons allowing for waterborne take-offs and landings. Production of the complete 150 airframe lot was had from 1960 until 1973.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/be12.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "NOT FOUND"
  },
  {
    "service": "NAVY",
    "name": "An-12",
    "model": "Antonov An-12",
    "country": "Soviet-union",
    "units": 5,
    "role": "Maritime Patrol",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "Five Antonov An-12 - developed from the earlier An-10 - fixed-wing aircraft are utilized by Russian Naval Aviation in the general maritime patrol role. Inducted in 1959, these are deep Cold War players that offer exceptional operational range through a quadruple turboprop engine arrangement. In all, 1,248 of these aircraft were built by Soviet aero-industry. While the airframe continues to age, the Chinese also utilize the type in a more modern form through the Shaanxi Y-5 series.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il18.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/421f6eda1b724d1b9771468f17365254/embed"
  },
  {
    "service": "NAVY",
    "name": "IL-20",
    "model": "Ilyushin IL-20",
    "country": "Soviet-union",
    "units": 2,
    "role": "Airborne Command",
    "assessment": "Aging, Requires Attention",
    "description": "A pair of Ilyushin Il-20 quadruple turboprop aircraft are reserved by Russian Naval Aviation for the critical Airborne Command and Control (C2) role. These are appropriately outfitted with the needed systems to assess and provide assistance to warplanners and allied units. Series introduction was in 1969.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il20.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/dbaeb6d5138448b7b47b9006dc5f244d/embed"
  },
  {
    "service": "NAVY",
    "name": "IL-22",
    "model": "Ilyushin IL-22",
    "country": "Soviet-union",
    "units": 2,
    "role": "Airborne Command",
    "assessment": "Modern Solution",
    "description": "Another fixed-wing, quaruple turboprop design utilized by Russian Naval Aviation in the Command and Control (C2) is the Ilyushin Il-22. The series was inducted in 1971 during the Soviet Cold War period and continues to actively operate under the Russian flag. The Airborne Command and Control is vital to waging an effective air and ground campaign.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/il18.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/6ba63e06628e491a9836e4a9c54c50f1/embed"
  },
  {
    "service": "NAVY",
    "name": "Be-200",
    "model": "Beriev Be-200",
    "country": "Soviet-union",
    "units": 1,
    "role": "Maritime Patrol",
    "assessment": "Modern Solution",
    "description": "The Beriev Be-200 is a jet-powered maritime patrol platform adopted in 2004. This unique aircraft relies on jet thrust for propulsion while being equipped with a boat-like hull and outboard pontoons for water-based take-offs and landings, giving the design tremendous tactical value in the maritime setting. The Be-200 is a further development of the A-40 platform of 1986. The Be-200 itself flew for the first time in 1998 and was introduced in July 2003. Nineteen hulls have been produced by the Beriev Aircraft Company to date.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/be200.webp",
    "flag_url": "flags/soviet-union.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/e4311cc11dbe4e2da85da3c643c4849f/embed"
  },
  {
    "service": "NAVY",
    "name": "L-39",
    "model": "Aero L-39 Albatros",
    "country": "Czechoslovakia",
    "units": 1,
    "role": "Advance Jet Training",
    "assessment": "Obsolete; Near-Obsolete",
    "description": "The Cold War-era Czech-originated Aero L-39 Albatros still serves modern Russian aviation in considerable numbers. The light strike / Advanced Jet Trainer (AJT) platform was debuted through a first-flight in 1968 and introduced in 1972 with the Czechoslovakian Air Force. From 1971 to 1996 there were over 2,500 of the type produced (production has since been restarted in 2023). The A-39 is an evolution of the earlier L-29 and includes the L-39NG, L59 Super Albatros, and L-159 ALCA offshoots. For its part, Russian aviation stocks the aircraft in its Air Force and Navy services.",
    "image_url": "https://www.warpowerrussia.com/imgs/aircraft/sml/l39.webp",
    "flag_url": "flags/czechoslovakia.jpg",
    "sketchfab_embed_url": "https://sketchfab.com/models/8add6f716b79418885bb9122f404c983/embed"
  }
]